/* SPDX-License-Identifier: (GPL-2.0 OR BSD-3-Clause) */
/*
 * Copyright (c) 2020 MediaTek Inc.
 */

#ifndef	_DRV_DTMB_H_
#define	_DRV_DTMB_H_

//-------------------------------------------------------------------
// Driver	Compiler	Options
//-------------------------------------------------------------------
#ifndef	DVB_STI // VT:	Temp	define	for	DVB_Frontend
	#define	DVB_STI		1
#endif

#if	DVB_STI	||	!defined	UTPA2//M5	Enter
#define	DMD_DTMB_UTOPIA_EN  1
#define	DMD_DTMB_UTOPIA2_EN 0
#else
#define	DMD_DTMB_UTOPIA_EN  0
#define	DMD_DTMB_UTOPIA2_EN 1
#endif

#if	DVB_STI	||	defined	MTK_PROJECT//VT
#define	DMD_DTMB_STR_EN              1
#define	DMD_DTMB_MULTI_THREAD_SAFE   1
#define	DMD_DTMB_MULTI_DMD_EN        1
#define	DMD_DTMB_3PARTY_EN           1
#define	DMD_DTMB_3PARTY_IN_KERNEL_EN 1
#define	DMD_DTMB_3PARTY_MSPI_EN      1
#else
#define	DMD_DTMB_STR_EN              1
#define	DMD_DTMB_MULTI_THREAD_SAFE   0
#define	DMD_DTMB_MULTI_DMD_EN        1
#define	DMD_DTMB_3PARTY_EN           0
#define	DMD_DTMB_3PARTY_IN_KERNEL_EN 0
#define	DMD_DTMB_3PARTY_MSPI_EN      0
#endif

#if	DMD_DTMB_3PARTY_EN
#undef	DMD_DTMB_UTOPIA_EN
#undef	DMD_DTMB_UTOPIA2_EN

#define	DMD_DTMB_UTOPIA_EN 0
#define	DMD_DTMB_UTOPIA2_EN	0

#if	DMD_DTMB_3PARTY_IN_KERNEL_EN
	#ifndef	UTPA2
	#define	UTPA2
	#endif
	#ifndef	MSOS_TYPE_LINUX_KERNEL
	#define	MSOS_TYPE_LINUX_KERNEL
	#endif
#endif // #if	DMD_DTMB_3PARTY_IN_KERNEL_EN
#endif // #if	DMD_DTMB_3PARTY_EN


#define	MEMCPY		memcpy
#endif // #ifdef	MSOS_TYPE_LINUX_KERNEL
#endif // #if	DMD_DTMB_3PARTY_EN

#if	DMD_DTMB_MULTI_DMD_EN
#define	DMD_DTMB_MAX_DEMOD_NUM					2
#else
#define	DMD_DTMB_MAX_DEMOD_NUM					1
#endif

#if	DMD_DTMB_UTOPIA_EN	||	DMD_DTMB_UTOPIA2_EN
#define	MSIF_DMD_DTMB_LIB_CODE {'D', 'M', 'D', '_'	'D', 'T', 'M', 'B', '_'}
#define	MSIF_DMD_DTMB_LIBVER {'0', '0'} //LIB	version
#define	MSIF_DMD_DTMB_BUILDNUM {'0', '0'	} //Build	Number
#define	MSIF_DMD_DTMB_CHANGELIST {'0', '0', '0', '0', '0', '0', '0', '0'}

#define	DMD_DTMB_VER /*Character String	for	DRV/API	version*/\
	 (MSIF_TAG,  /*	'MSIF'	 */	\
		MSIF_CLASS,  /*	'00'		 */	\
		MSIF_CUS,  /*	0x0000	 */	\
		MSIF_MOD,  /*	0x0000	 */	\
		MSIF_CHIP,	\
		MSIF_CPU, \
		MSIF_DMD_DTMB_LIB_CODE,  /*	IP__		 */	\
		MSIF_DMD_DTMB_LIBVER, /*0.0	~Z.Z */	\
		MSIF_DMD_DTMB_BUILDNUM,  /*	00	~	99 */	\
		MSIF_DMD_DTMB_CHANGELIST,  /*	CL#		 */	\
		MSIF_OS)
#endif // #if	DMD_DTMB_UTOPIA_EN	||	DMD_DTMB_UTOPIA2_EN

#ifndef	BIT_
#define	BIT_(n) (1 << (n))
#endif

#define	DMD_DTMB_LOCK_DTMB_PNP_LOCK  BIT_(0)
#define	DMD_DTMB_LOCK_DTMB_FEC_LOCK  BIT_(1)

#define	DMD_DTMB_LOCK_DVBC_AGC_LOCK  BIT_(8)
#define	DMD_DTMB_LOCK_DVBC_PRE_LOCK  BIT_(9)
#define	DMD_DTMB_LOCK_DVBC_MAIN_LOCK BIT_(10)

//-------------------------------------------------------------------
// Type and	Structure
//-------------------------------------------------------------------

//typedef	enum{
enum DMD_DTMB_HAL_COMMAND {
		DMD_DTMB_HAL_CMD_Exit	= 0,
		DMD_DTMB_HAL_CMD_InitClk,
		DMD_DTMB_HAL_CMD_Download,
		DMD_DTMB_HAL_CMD_FWVERSION,
		DMD_DTMB_HAL_CMD_SoftReset,
		DMD_DTMB_HAL_CMD_SetACICoef,
		DMD_DTMB_HAL_CMD_SetDTMBMode,
		DMD_DTMB_HAL_CMD_SetModeClean,
		DMD_DTMB_HAL_CMD_Set_QAM_SR,
		DMD_DTMB_HAL_CMD_Active,
		DMD_DTMB_HAL_CMD_AGCLock,
		DMD_DTMB_HAL_CMD_DTMB_PNP_Lock,
		DMD_DTMB_HAL_CMD_DTMB_FEC_Lock,
		DMD_DTMB_HAL_CMD_DVBC_PreLock,
		DMD_DTMB_HAL_CMD_DVBC_Main_Lock,
		DMD_DTMB_HAL_CMD_GetModulation,
		DMD_DTMB_HAL_CMD_ReadIFAGC,
		DMD_DTMB_HAL_CMD_ReadFrequencyOffset,
		DMD_DTMB_HAL_CMD_ReadSNRPercentage,
		DMD_DTMB_HAL_CMD_GetPreLdpcBer,
		DMD_DTMB_HAL_CMD_GetPreViterbiBer,
		DMD_DTMB_HAL_CMD_GetPostViterbiBer,
		DMD_DTMB_HAL_CMD_GetSNR,
		DMD_DTMB_HAL_CMD_TS_INTERFACE_CONFIG,
		DMD_DTMB_HAL_CMD_IIC_Bypass_Mode,
		DMD_DTMB_HAL_CMD_SSPI_TO_GPIO,
		DMD_DTMB_HAL_CMD_GPIO_GET_LEVEL,
		DMD_DTMB_HAL_CMD_GPIO_SET_LEVEL,
		DMD_DTMB_HAL_CMD_GPIO_OUT_ENABLE,
		DMD_DTMB_HAL_CMD_DoIQSwap,
		DMD_DTMB_HAL_CMD_GET_REG,
		DMD_DTMB_HAL_CMD_SET_REG,
		DMD_DTMB_HAL_CMD_SQI,
		DMD_DTMB_HAL_CMD_SSI,
		DMD_DTMB_HAL_CMD_ICP,
		DMD_DTMB_HAL_CMD_IFAGC
};//DMD_DTMB_HAL_COMMAND;

//typedef	enum{
enum DMD_DTMB_DEMOD_TYPE {
		DMD_DTMB_DEMOD_DTMB,
		DMD_DTMB_DEMOD_DTMB_7M,
		DMD_DTMB_DEMOD_DTMB_6M,
		DMD_DTMB_DEMOD_DTMB_5M,
		DMD_DTMB_DEMOD_DVBC_64QAM,
		DMD_DTMB_DEMOD_DVBC_256QAM,
		DMD_DTMB_DEMOD_DVBC_16QAM,
		DMD_DTMB_DEMOD_DVBC_32QAM,
		DMD_DTMB_DEMOD_DVBC_128QAM,
		DMD_DTMB_DEMOD_MAX,
		DMD_DTMB_DEMOD_NULL	= DMD_DTMB_DEMOD_MAX,
};//	DMD_DTMB_DEMOD_TYPE;

//typedef	struct	DLL_PACKED {
struct	DLL_PACKED DMD_DTMB_MODULATION_INFO {
		union{
				#ifdef	UTPA2
				u16 fsicoderate; //0.4, 0.6, 0.8
				u16 fDvbcSymRateL;
				#else
				float	fsicoderate; //0.4, 0.6, 0.8
				float	fDvbcSymRateL;
				#endif
		};
		union{
				u16 usiinterleaver16; //240, 720
				u16 udvbcsymrateh16;
		};
		union{
				u8 usiqammode8; //4QAM, 16QAM, 32QAM, 64QAM
				u8 udvbcqammode8;
		};
		u8 usinr8;
		u8 usicarriermode8; //0: multiple carrier,1:single carrier
		u16 upnm16; //420, 595, 945
		u8 upnc8; //0:	variable, 1:	constant
		enum DMD_DTMB_DEMOD_TYPE eDemodType; //DTMB or	DVBC
};//	DMD_DTMB_MODULATION_INFO;

//typedef	struct	DLL_PACKED {
struct	DLL_PACKED DMD_DTMB_CFO_DATA {
		s16	fftfirstcfo;
		s8	fftsecondcfo;
		s16	sr;
};//	DMD_DTMB_CFO_DATA;

//typedef	struct	DLL_PACKED {
struct DLL_PACKED DMD_DTMB_BER_DATA {
		u32	biterr;
		u16 error_window;
};//DMD_DTMB_BER_DATA;

//typedef	struct	DLL_PACKED {
struct	DLL_PACKED DMD_DTMB_SNR_DATA {
		u32	snr;
		u16 sym_num;
};//	DMD_DTMB_SNR_DATA;

//typedef	struct	DLL_PACKED {
struct	DLL_PACKED DMD_DTMB_GPIO_PIN_DATA {
		u8 upin8;
		union{
				u8	blevel;
				u8	bIsOut;
		};
};//	DMD_DTMB_GPIO_PIN_DATA;

//typedef	struct	DLL_PACKED {
struct DLL_PACKED DMD_DTMB_REG_DATA {
		u16 uaddr16;
		u8 udata8;
};//	DMD_DTMB_REG_DATA;

//typedef	enum{
enum DMD_DTMB_DbgLv {
		DMD_DTMB_DBGLV_NONE,  // disable all the debug message
		DMD_DTMB_DBGLV_INFO,  // information
		DMD_DTMB_DBGLV_NOTICE, // normal but significant condition
		DMD_DTMB_DBGLV_WARNING, // warning	conditions
		DMD_DTMB_DBGLV_ERR, // error	conditions
		DMD_DTMB_DBGLV_CRIT,  // critical	conditions
		DMD_DTMB_DBGLV_ALERT,  // action must be taken immediately
		DMD_DTMB_DBGLV_EMERG,  // system	is	unusable
		DMD_DTMB_DBGLV_DEBUG,  // debug-level	messages
};//	DMD_DTMB_DbgLv;

//typedef	enum{
enum DMD_DTMB_GETLOCK_TYPE {
		DMD_DTMB_GETLOCK,
		DMD_DTMB_GETLOCK_DTMB_AGCLOCK,
		DMD_DTMB_GETLOCK_DTMB_PNPLOCK,
		DMD_DTMB_GETLOCK_DTMB_FECLOCK,
		DMD_DTMB_GETLOCK_DVBC_AGCLOCK,
		DMD_DTMB_GETLOCK_DVBC_PRELOCK,
		DMD_DTMB_GETLOCK_DVBC_MAINLOCK,
};//	DMD_DTMB_GETLOCK_TYPE;

//typedef	enum{
enum DMD_DTMB_LOCK_STATUS {
		DMD_DTMB_LOCK,
		DMD_DTMB_CHECKING,
		DMD_DTMB_CHECKEND,
		DMD_DTMB_UNLOCK,
		DMD_DTMB_NULL,
};//	DMD_DTMB_LOCK_STATUS;

//#if (DMD_DTMB_STR_EN && !DMD_DTMB_UTOPIA_EN && !DMD_DTMB_UTOPIA2_EN)
//typedef	enum{
//		E_POWER_SUSPEND = 1,
//		E_POWER_RESUME = 2,
//		E_POWER_MECHANICAL	= 3,
//		E_POWER_SOFT_OFF = 4,
//}	EN_POWER_MODE;
//#endif

/// For	demod	init
//typedef	struct	DLL_PACKED {
struct	DLL_PACKED	DMD_DTMB_InitData {
	 // init
		u16 udtmbagclockchecktime16;//50
		u16 udtmbprelockchecktime16;//300
		u16 udtmbpnmlockchecktime16;//1200
		u16 udtmbfeclockchecktime16;//5000

		u16 uqamagclockchecktime16;//50
		u16 uqamprelockchecktime16;//1000
		u16 uqammainlockchecktime16;//3000

	 // register	init
		u8 *u8DMD_DTMB_DSPRegInitExt; //TODO use system variable type
		u8 u8DMD_DTMB_DSPRegInitSize;
		u8 *u8DMD_DTMB_InitExt; // TODO use system variable type

	 //By	Tuners:
		u16 uif_khz16;//By	Tuners
		u8	bIQSwap;//0
		u16 uagc_reference16;//0
		u8	btunergaininvert;//0

	 //By	IC:
		u8 uis_dual8;//0
		u8	bisextdemod;//0

	 //By	TS (Only	for	MCP	or	ext	demod):
		u8 u1TsConfigByte_SerialMode	:	1;
		u8 u1TsConfigByte_DataSwap		:	1;
		u8 u1TsConfigByte_ClockInv		:	1;
		u8 u5TsConfigByte_DivNum			:	5;

	 //By	SYS	I2C (Only	for	MCP	or	ext	demod):
		u8 u8I2CSlaveAddr;
		u8 u8I2CSlaveBus;
		u8 (*I2C_WriteBytes)(u16 u16BusNumSlaveID,
		u8 u8addrcount, u8 *pu8addr, u16 usize16,
	    u8 *pudata8);
		u8 (*I2C_ReadBytes)(u16 u16BusNumSlaveID,
		u8 u8AddrNum, u8 *paddr, u16 usize16, u8 *pudata8);

	 //By	SYS	MSPI (Only	for	MCP	or	ext	demod):
		u8	bIsUseSspiLoadCode;
		u8	bIsSspiUseTsPin;

	 //By	SYS	memory	mapping (Only	for	int	demod):
